OpenFOAM/reatorWALE_60mL/0/TKEDR
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      TKEDR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 0;
    }
    geo_100_mL_Wheel
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder_AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    cylinder_AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    Modified_100mL_Vessel
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
