OpenFOAM/reatorWALE_60mL/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    geo_100_mL_Wheel
    {
        type            zeroGradient;
    }
    cylinder_AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    cylinder_AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    Modified_100mL_Vessel
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
