OpenFOAM/reatorWALE_60mL/system/decomposeParDict
//
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	decomposeParDict;
}
numberOfSubdomains	16;
//method	hierarchical;
method	scotch;
hierarchicalCoeffs
{
    n               (1 3 1);
    delta           0.001;
    order           xyz;
}
distributed	false;
roots	();
