OpenFOAM/reatorWALE_60mL/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fields to be probed. runTime modifiable!
fields
(   
    p
    CO2
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (0.0254 0.0253 0.0)
    (0.0508 0.0253 0.0)
    (0.0762 0.0253 0.0)
    (0.1016 0.0253 0.0)
    (0.1270 0.0253 0.0)
    (0.1524 0.0253 0.0)
    (0.1778 0.0253 0.0)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
